# -*- coding: utf-8 -*
'''
遍历文件夹中的文件
'''

import os
dir = r"C:\Users\MaleBird\Desktop\批发价格（2011年至2017年）\2017\待处理"
dirs = os.listdir(dir)
for dirc in dirs:
    print(dirc)
print(dirs)
print(len(dirs))

newdir = r"C:\Users\MaleBird\Desktop\批发价格（2011年至2017年）\2017\已处理"
newdirs = ['201701_1', '201701_2','201701_3','201702_1','201702_2', '201702_3', '201703_1', '201703_2', '201703_3',	'201704_1',	'201704_2',	'201704_3', '201705_1',	'201705_2', '201705_3', '201706_1', '201706_2',	'201706_3', 	'201707_1',	'201707_2',	'201707_3',	'201708_1', '201708_2',	'201708_3', '201709_1']
print(newdirs)
print(len(newdirs))
