import os
import pandas as pd
#确定各个excel所在的文件夹路径
#dirList 为每年的数据所在文件夹的名称
dirList = os.listdir(r"D:\中国蔬菜协会（不同步）\全国农产品成本收益资料汇1990-2019")
dirList.reverse()
print(dirList)

#dirList
'''
[ '全国农产品成本收益资料汇编2018-EXCEL-257',
 '全国农产品成本收益资料汇编2017(EXCEL)607',
 '全国农产品成本收益资料汇编2016(EXCEL)607',
 '全国农产品成本收益资料汇编2015(EXCEL)601',
 '全国农产品成本收益资料汇编2014(EXCEL)603',
 '全国农产品成本收益资料汇编2013(EXCEL)261',
 '全国农产品成本收益资料汇编2012(EXCEL)262',
 '全国农产品成本收益资料汇编2011(EXCEL)220',
 '全国农产品成本收益资料汇编2010(EXCEL)220',
 '全国农产品成本收益资料汇编2009(EXCEL)248',
 '全国农产品成本收益资料汇编2008(EXCEL)291',
 '全国农产品成本收益资料汇编2007(EXCEL)309',
 '全国农产品成本收益资料汇编2006-EXCEL-294',
 '全国农产品成本收益资料汇编2005-EXCEL-290',
 '全国农产品成本收益资料汇编2004-EXCEL-693',
 '全国农产品成本收益资料汇编2003-EXCEL-653',
 '全国农产品成本收益资料汇编2002-EXCEL-779',
 '全国农产品成本收益资料汇编2001-EXCEL-523',
 '全国农产品成本收益资料汇编2000-EXCEL-666',
 '全国农产品成本收益资料汇编1999-EXCEL-584',
 '全国农产品成本收益资料汇编1998-EXCEL-423',
 '全国农产品成本收益资料汇编1997-EXCEL-419',
 '全国农产品成本收益资料汇编1996-EXCEL-396',
 '全国农产品成本收益资料汇编1995-EXCEL-414',
 '全国农产品成本收益资料汇编1994-EXCEL-366',
 '全国农产品成本收益资料汇编1993-EXCEL-283',
 '全国农产品成本收益资料汇编1992-EXCEL-312',
 '全国农产品成本收益资料汇编1991-EXCEL-323',
 '全国农产品成本收益资料汇编1990-EXCEL-230']
 '''
tableIndexList = [
    '6-1-1-1', '6-1-1-2', '6-1-1-3', '6-1-2-1', '6-1-2-2', '6-1-2-3',
    '6-1-3-1', '6-1-3-2', '6-1-3-3', '6-1-4-1', '6-1-4-2', '6-1-4-3',
    '6-1-5-1', '6-1-5-2', '6-1-5-3', '6-1-6-1', '6-1-6-2', '6-1-6-3',
    '6-1-7-1', '6-1-7-2', '6-1-7-3', '6-1-8-1', '6-1-8-2', '6-1-8-3',
    '6-1-9-1', '6-1-9-2', '6-1-9-3', '6-1-10-1', '6-1-10-2', '6-1-10-3',
    '6-1-11-1', '6-1-11-2', '6-1-11-3', '6-1-12-1', '6-1-12-2', '6-1-12-3',
    '6-1-13-1', '6-1-13-2', '6-1-13-3', '6-1-14-1', '6-1-14-2', '6-1-14-3',
    '6-2-1-1', '6-2-1-2', '6-2-1-3', '6-2-2-1', '6-2-2-2', '6-2-2-3',
    '6-2-3-1', '6-2-3-2', '6-2-3-3', '6-2-4-1', '6-2-4-2', '6-2-4-3',
    '6-2-5-1', '6-2-5-2', '6-2-5-3', '6-2-6-1', '6-2-6-2', '6-2-6-3',
    '6-2-7-1', '6-2-7-2', '6-2-7-3', '6-2-8-1', '6-2-8-2', '6-2-8-3',
    '6-2-9-1', '6-2-9-2', '6-2-9-3', '6-2-10-1', '6-2-10-2', '6-2-10-3',
    '6-2-11-1', '6-2-11-2', '6-2-11-3', '6-2-12-1', '6-2-12-2', '6-2-12-3',
    '6-2-13-1', '6-2-13-2', '6-2-13-3', '6-2-14-1', '6-2-14-2', '6-2-14-3'
]
tableNameList = [
    '各地区露地西红柿成本收益情况', '各地区露地西红柿费用和用工情况', '各地区露地西红柿化肥投入情况', '各地区设施西红柿成本收益情况',
    '各地区设施西红柿费用和用工情况', '各地区设施西红柿化肥投入情况', '各地区露地黄瓜成本收益情况', '各地区露地黄瓜费用和用工情况',
    '各地区露地黄瓜化肥投入情况', '各地区设施黄瓜成本收益情况', '各地区设施黄瓜费用和用工情况', '各地区设施黄瓜化肥投入情况',
    '各地区露地茄子成本收益情况', '各地区露地茄子费用和用工情况', '各地区露地茄子化肥投入情况', '各地区设施茄子成本收益情况',
    '各地区设施茄子费用和用工情况', '各地区设施茄子化肥投入情况', '各地区露地菜椒成本收益情况', '各地区露地菜椒费用和用工情况',
    '各地区露地菜椒化肥投入情况', '各地区设施菜椒成本收益情况', '各地区设施菜椒费用和用工情况', '各地区设施菜椒化肥投入情况',
    '各地区露地圆白菜成本收益情况', '各地区露地圆白菜费用和用工情况', '各地区露地圆白菜化肥投入情况', '各地区露地大白菜成本收益情况',
    '各地区露地大白菜费用和用工情况', '各地区露地大白菜化肥投入情况', '各地区露地马铃薯成本收益情况', '各地区露地马铃薯费用和用工情况',
    '各地区露地马铃薯化肥投入情况', '各地区露地菜花成本收益情况', '各地区露地菜花费用和用工情况', '各地区露地菜花化肥投入情况',
    '各地区露地萝卜成本收益情况', '各地区露地萝卜费用和用工情况', '各地区露地萝卜化肥投入情况', '各地区露地豆角成本收益情况',
    '各地区露地豆角费用和用工情况', '各地区露地豆角化肥投入情况', '大中城市露地西红柿成本收益情况', '大中城市露地西红柿费用和用工情况',
    '大中城市露地西红柿化肥投入情况', '大中城市设施西红柿成本收益情况', '大中城市设施西红柿费用和用工情况',
    '大中城市设施西红柿化肥投入情况', '大中城市露地黄瓜成本收益情况', '大中城市露地黄瓜费用和用工情况', '大中城市露地黄瓜化肥投入情况',
    '大中城市设施黄瓜成本收益情况', '大中城市设施黄瓜费用和用工情况', '大中城市设施黄瓜化肥投入情况', '大中城市露地茄子成本收益情况',
    '大中城市露地茄子费用和用工情况', '大中城市露地茄子化肥投入情况', '大中城市设施茄子成本收益情况', '大中城市设施茄子费用和用工情况',
    '大中城市设施茄子化肥投入情况', '大中城市露地菜椒成本收益情况', '大中城市露地菜椒费用和用工情况', '大中城市露地菜椒化肥投入情况',
    '大中城市设施菜椒成本收益情况', '大中城市设施菜椒费用和用工情况', '大中城市设施菜椒化肥投入情况', '大中城市露地圆白菜成本收益情况',
    '大中城市露地圆白菜费用和用工情况', '大中城市露地圆白菜化肥投入情况', '大中城市露地大白菜成本收益情况',
    '大中城市露地大白菜费用和用工情况', '大中城市露地大白菜化肥投入情况', '大中城市露地马铃薯成本收益情况',
    '大中城市露地马铃薯费用和用工情况', '大中城市露地马铃薯化肥投入情况', '大中城市露地菜花成本收益情况', '大中城市露地菜花费用和用工情况',
    '大中城市露地菜花化肥投入情况', '大中城市露地萝卜成本收益情况', '大中城市露地萝卜费用和用工情况', '大中城市露地萝卜化肥投入情况',
    '大中城市露地豆角成本收益情况', '大中城市露地豆角费用和用工情况', '大中城市露地豆角化肥投入情况'
]
vegNameList = [
    '西红柿', '西红柿', '西红柿', '西红柿', '西红柿', '西红柿', '黄瓜', '黄瓜', '黄瓜', '黄瓜', '黄瓜',
    '黄瓜', '茄子', '茄子', '茄子', '茄子', '茄子', '茄子', '菜椒', '菜椒', '菜椒', '菜椒', '菜椒',
    '菜椒', '圆白菜', '圆白菜', '圆白菜', '大白菜', '大白菜', '大白菜', '马铃薯', '马铃薯', '马铃薯', '菜花',
    '菜花', '菜花', '萝卜', '萝卜', '萝卜', '豆角', '豆角', '豆角', '西红柿', '西红柿', '西红柿', '西红柿',
    '西红柿', '西红柿', '黄瓜', '黄瓜', '黄瓜', '黄瓜', '黄瓜', '黄瓜', '茄子', '茄子', '茄子', '茄子',
    '茄子', '茄子', '菜椒', '菜椒', '菜椒', '菜椒', '菜椒', '菜椒', '圆白菜', '圆白菜', '圆白菜', '大白菜',
    '大白菜', '大白菜', '马铃薯', '马铃薯', '马铃薯', '菜花', '菜花', '菜花', '萝卜', '萝卜', '萝卜',
    '豆角', '豆角', '豆角'
]

cultivateList = [
    '露地', '露地', '露地', '设施', '设施', '设施', '露地', '露地', '露地', '设施', '设施', '设施',
    '露地', '露地', '露地', '设施', '设施', '设施', '露地', '露地', '露地', '设施', '设施', '设施',
    '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地',
    '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地', '设施', '设施', '设施',
    '露地', '露地', '露地', '设施', '设施', '设施', '露地', '露地', '露地', '设施', '设施', '设施',
    '露地', '露地', '露地', '设施', '设施', '设施', '露地', '露地', '露地', '露地', '露地', '露地',
    '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地', '露地'
]
tableTypeList = [
    '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况',
    '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况',
    '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况',
    '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况',
    '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况',
    '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况',
    '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况',
    '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况',
    '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况',
    '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况',
    '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况',
    '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况', '成本收益情况', '费用和用工情况', '化肥投入情况'
]
areaTypeList = [
    '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市',
    '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市',
    '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市',
    '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市',
    '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市',
    '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市',
    '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市',
    '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市', '省/自治区/直辖市',
    '省/自治区/直辖市', '省/自治区/直辖市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市',
    '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市',
    '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市',
    '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市',
    '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市', '大中城市'
]
dirAddressList = []
contentsDocList = []
'''
#contentsDocAddressList为各年的目录文件的路径
contentsDocAddressList = []
for i in range(len(dirList)):
    contentDir = r"D:\中国蔬菜协会（不同步）\全国农产品成本收益资料汇1990-2019" + '\\' + dirList[i]
    contentsDocList.append(
        os.listdir(contentDir)[-1])  #只采集该路径下的最后一个文件，其中96年的手动删除不要的文件
    contentsDocAddressList.append(contentDir + '\\' +
                                  os.listdir(contentDir)[-1])
'''
contentsDocAddressList = [
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2018-EXCEL-257\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2017(EXCEL)607\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2016(EXCEL)607\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2015(EXCEL)601\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2014(EXCEL)603\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2013(EXCEL)261\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2012(EXCEL)262\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2011(EXCEL)220\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2010(EXCEL)220\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2009(EXCEL)248\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2008(EXCEL)291\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2007(EXCEL)309\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2006-EXCEL-294\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2005-EXCEL-290\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2004-EXCEL-693\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2003-EXCEL-653\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2002-EXCEL-779\\目录【请勿只解压本目录】.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2001-EXCEL-523\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编2000-EXCEL-666\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编1999-EXCEL-584\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编1998-EXCEL-423\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编1997-EXCEL-419\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编1996-EXCEL-396\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编1995-EXCEL-414\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编1994-EXCEL-366\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编1993-EXCEL-283\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编1992-EXCEL-312\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编1991-EXCEL-323\\目录.xlsx',
    'D:\\中国蔬菜协会（不同步）\\全国农产品成本收益资料汇1990-2019\\全国农产品成本收益资料汇编1990-EXCEL-230\\目录.xlsx'
]
